app/views/books/index.html.erb

                    <%= link_to book_favorites_path(book), method: :delete, class: "text-danger"  do%>
                      <i class="fas fa-heart" style="color: red;"></i><%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

                    <%= link_to book_favorites_path(book), method: :post do %>
                      <i class="fas fa-heart" style="color: aqua;"></i><%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

              </td>
              <td>コメント数: <%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]