app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    flash[:notice] = "You have created book successfully."
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "dd"], ["body", "dd"], ["user_id", 1], ["created_at", "2021-10-27 09:49:50.416147"], ["updated_at", "2021-10-27 09:49:50.416147"]]

  def show
    @new_book = Book.new
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]