app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "良いね！"], ["user_id", 1], ["book_id", 1], ["created_at", "2021-10-27 09:50:00.124416"], ["updated_at", "2021-10-27 09:50:00.124416"]]
---
  def create
    book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = book.id
    comment.save

DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 2]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    BookComment.find_by(id: params[:id]).destroy