app/controllers/users_controller.rb

  def index
    @user = current_user
    @book = Book.new
    @users = User.all
---
SELECT "users".* FROM "users"